mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************************************************
 * @file        FMKIO.c
 * @brief       Template_BriefDescription.
 * @note        TemplateDetailsDescription.\n
 *
 * @author      xxxxxx
 * @date        jj/mm/yyyy
 * @version     1.0
 */

// ********************************************************************
// *                      Includes
// ********************************************************************

#include "stm32f0xx_hal.h"
#include "./FMK_IO.h"
#include "FMK_CFG/FMKCFG_ConfigFiles/FMKIO_ConfigPrivate.h"
#include "FMK_HAL/FMK_CDA/Src/FMK_CDA.h"

// ********************************************************************
// *                      Defines
// ********************************************************************
#define FMKIO_AF_UNUSED ((t_uint8)0xFF) /**< Flag to say that the alternate function is not used in Signal Init */
// ********************************************************************
// *                      Types
// ********************************************************************
//-----------------------------ENUM TYPES-----------------------------//
/* CAUTION : Automatic generated code section for Enum: Start */

/* CAUTION : Automatic generated code section for Enum: End */

//-----------------------------TYPEDEF TYPES---------------------------//
//-----------------------------STRUCT TYPES---------------------------//
/* CAUTION : Automatic generated code section for Structure: Start */

/* CAUTION : Automatic generated code section for Structure: End */
/**< Structure common to all signal to repertory signal information */
typedef struct
{
    t_eFMKIO_PullMode pull_e;
    t_eFMKIO_SpdMode spd_e;
    t_eFMKIO_AlternateFunc altFunc_e;
    t_bool IsSigConfigured_b;
    t_bool IsInterruptEnable_b;
    t_cbFMKIO_EventFunc *EvntFunc_cb;

} t_sFMKIO_SigInfo;
// ********************************************************************
// *                      Prototypes
// ********************************************************************

// ********************************************************************
// *                      Variables
// ********************************************************************
t_sFMKIO_SigInfo g_InFreqSigInfo_as[FMKIO_INPUT_SIGFREQ_NB];        /**< Signal information for input frequency */
t_sFMKIO_SigInfo g_InAnaSigInfo_as[FMKIO_INPUT_SIGANA_NB];          /**< Signal information for input Analog */
t_sFMKIO_SigInfo g_InDigSigInfo_as[FMKIO_INPUT_SIGDIG_NB];          /**< Signal information for input Digital */
t_sFMKIO_SigInfo g_InEvntSigInfo_as[FMKIO_INPUT_SIGEVNT_NB];        /**< Signal information for input Event */
t_sFMKIO_SigInfo g_OutPwmSigInfo_as[FMKIO_OUTPUT_SIGPWM_NB];        /**< Signal information for output PWM */
t_sFMKIO_SigInfo g_OutDigSigInfo_as[FMKIO_OUTPUT_SIGDIG_NB];        /**< Signal information for output Digital */

/* CAUTION : Automatic generated code section for Variable: Start */

/* CAUTION : Automatic generated code section for Variable: End */
/**< Variable to store the state of GPIO Clock */
t_eFMKCPU_ClockPortOpe g_IsGpioClockEnable_ae[FMKIO_GPIO_PORT_NB] = {
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_A
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_B
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_C
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_D
    FMKCPU_CLOCKPORT_OPE_DISABLE, // FMKIO_GPIO_PORT_F
};

/**< Variable to put the Signal Frequency value */
t_uint32 g_InFreqSigRawValue_ua32[FMKIO_INPUT_SIGFREQ_NB];
/**< Module state */
static t_eCyclicFuncState g_state_e = STATE_CYCLIC_WAITING;
//********************************************************************************
//                      Local functions - Prototypes
//********************************************************************************
/**
 *
 *	@brief      Get the Bsp Pull Mode 
 *	@note       Using the enum f_pull_e and switch case, this function 
                return the right uint32 hal pull for a pin.\n
 *
 *
 *	@param[in]  f_pull_e       : the enum that says the pull mode, value from @ref t_eFMKIO_PullMode
 *	@param[in]  f_bspPull_pu32 : the Hal value correponding the enum
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_PARAM_NOT_SUPPORTED      @ref RC_ERROR_PARAM_NOT_SUPPORTED
 *
 */
static t_eReturnState s_FMKIO_Get_BspPullMode(t_eFMKIO_PullMode f_pull_e, t_uint32 *f_bspPull_pu32);
/**
 *
 *	@brief      Get the Bsp speed Mode 
 *	@note       Using the enum f_spd_e and switch case, this function 
                return the right uint32 hal speed for a pin.\n
 *
 *
 *	@param[in]  f_spd_e       : the enum that says the speed mode, value from @ref t_eFMKIO_SpdMode
 *	@param[in]  f_bspSpd_pu32 : the Hal value correponding the enum
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_PARAM_NOT_SUPPORTED      @ref RC_ERROR_PARAM_NOT_SUPPORTED
 *
 */
static t_eReturnState s_FMKIO_Get_BspSpdMode(t_eFMKIO_SpdMode f_spd_e, t_uint32 *f_bspSpd_pu32);
/**
 *
 *	@brief      Get the Bsp Gpio Port Instance 
 *	@note       Using the enum f_spd_e and switch case, this function 
                return the right GPIOPort Instance.\n
 *
 *
 *	@param[in]  f_GpioPort_e       : GPIOPort enum from @ref t_eFMKIO_GpioPort
 *	@param[in]  f_BspGpio_ps       : pointor to pointor to change the direction a the pointer
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_PARAM_NOT_SUPPORTED      @ref RC_ERROR_PARAM_NOT_SUPPORTED
 *
 */
static t_eReturnState s_FMKIO_Get_BspGpioPort(t_eFMKIO_GpioPort f_GpioPort_e, GPIO_TypeDef **f_BspGpio_ps);
/**
 *
 *	@brief      Get the Bsp trigger Mode for signal event
 *	@note       Using the enum f_trigger_e and switch case, this function 
                return the right uint32 hal trigger for a pin.\n
 *
 *
 *	@param[in]  f_trigger_e           : the enum that says the trigger mode, value from @ref t_eFMKIO_SigTrigCptr
 *	@param[in]  f_bspTrigger_pu32     : the Hal value correponding the enum
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PTR_NULL                 @ref RC_ERROR_PTR_NULL
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 * @retval RC_ERROR_PARAM_NOT_SUPPORTED      @ref RC_ERROR_PARAM_NOT_SUPPORTED
 *
 */
static t_eReturnState s_FMKIO_Get_BspTriggerMode(t_eFMKIO_SigTrigCptr f_trigger_e, t_uint32 *f_bspTrigger_pu32);
/**
 *
 *	@brief      This function set the Init of a pin on a GPIO
 *
 *	@param[in]  f_GpioPort_e     : GPIOPort enum from @ref t_eFMKIO_GpioPort
 *	@param[in]  f_pin_e          : pin enum from @ref t_eFMKIO_BspGpioPin
 *	@param[in]  f_mode_u32       : Pin Mode from HAL_GPIO.h
 *	@param[in]  f_pull_e         : the enum that says the pull mode, value from @ref t_eFMKIO_PullMode
 *	@param[in]  f_spd_e          : the enum that says the speed mode, value from @ref t_eFMKIO_SpdMode
 *	@param[in]  f_AltFunc_u8     : the alternate function, FMKIO_AF_UNUSED if not used
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *
 */
static t_eReturnState s_FMKIO_Set_BspSigCfg(t_eFMKIO_GpioPort f_gpioPort_e,
                                            t_eFMKIO_BspGpioPin f_pin_e,
                                            t_uint32 f_mode_u32,
                                            t_eFMKIO_PullMode f_pull_e,
                                            t_eFMKIO_SpdMode f_spd_e,
                                            t_uint8 f_AltFunc_u8);
/**
 *
 *	@brief      FMKCPU callback function to determine signal frequency value
 *
 *	@param[in]  f_timer_e        : timer from  @ref t_eFMKCPU_Timer
 *	@param[in]  f_channel_e      : timer channel  from @ref t_eFMKCPU_InterruptChnl
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *
 */
static t_eReturnState s_FMKIO_MngSigFrequency(t_eFMKCPU_Timer f_timer_e, t_eFMKCPU_InterruptChnl f_channel_e);
/**
 *
 *	@brief      Function to set HAL_RCC clock state : Enable/Disable
 *
 *	@param[in]  f_GpioPort_e     : GPIOPort enum, value from @ref t_eFMKIO_GpioPort
 *	@param[in]  f_ope_e          : Enable or Diable RCC clock, value from @ref t_eFMKCPU_ClockPortOpe
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *
 */
static t_eReturnState s_FMKIO_Set_GpioClkState(t_eFMKIO_GpioPort f_gpioPort_e, t_eFMKCPU_ClockPortOpe f_ope_e);
/**
 *
 *	@brief      Function to perform diag on siganl used 
 *
 * @retval RC_OK                             @ref RC_OK
 * @retval RC_ERROR_PARAM_INVALID            @ref RC_ERROR_PARAM_INVALID
 *
 */
static t_eReturnState s_FMKIO_Operational(void);
//****************************************************************************
//                      Public functions - Implementation
//********************************************************************************
/*********************************
 * FMKCPU_Init
 *********************************/
t_eReturnState FMKIO_Init(void)
{
    t_uint8 LLI_u8;
    
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGFREQ_NB ; LLI_u8++)
    {
        g_InFreqSigRawValue_ua32[LLI_u8] = (t_uint32)0;
        g_InFreqSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InFreqSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InFreqSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InFreqSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InFreqSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InFreqSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGANA_NB ; LLI_u8++)
    {
        g_InAnaSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InAnaSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InAnaSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InAnaSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InAnaSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InAnaSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGDIG_NB ; LLI_u8++)
    {
        g_InDigSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InDigSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InDigSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InDigSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InDigSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InDigSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_INPUT_SIGEVNT_NB ; LLI_u8++)
    {
        g_InEvntSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_InEvntSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_InEvntSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_InEvntSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_InEvntSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_InEvntSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_OUTPUT_SIGPWM_NB ; LLI_u8++)
    {
        g_OutPwmSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_OutPwmSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_OutPwmSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_OutPwmSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_OutPwmSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_OutPwmSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < (t_uint8)FMKIO_OUTPUT_SIGDIG_NB ; LLI_u8++)
    {
        g_OutDigSigInfo_as[LLI_u8].altFunc_e = FMKIO_AF_NB;
        g_OutDigSigInfo_as[LLI_u8].EvntFunc_cb = NULL;
        g_OutDigSigInfo_as[LLI_u8].IsInterruptEnable_b = False;
        g_OutDigSigInfo_as[LLI_u8].IsSigConfigured_b   = False;
        g_OutDigSigInfo_as[LLI_u8].pull_e = FMKIO_PULL_MODE_UNABLE;
        g_OutDigSigInfo_as[LLI_u8].spd_e = FMKIO_SPD_MODE_MEDIUM;
    }

