mbarbeau0545/Stm32PrjTpl/src/1_FMK/FMK_HAL/FKM_IO/Src/FMK_IO.c
/*********************************
 * s_FMKIO_Get_BspPullMode
 *********************************/
static t_eReturnState s_FMKIO_Get_BspSpdMode(t_eFMKIO_SpdMode f_spd_e, t_uint32 *f_bspSpd_pu32)
{
    t_eReturnState Ret_e = RC_OK;

    if (f_spd_e > FMKIO_SPD_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (f_bspSpd_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if (Ret_e == RC_OK)
    {
        switch (f_spd_e)
        {
        case FMKIO_SPD_MODE_LOW:
            *f_bspSpd_pu32 = GPIO_SPEED_FREQ_LOW;
            break;
        case FMKIO_SPD_MODE_MEDIUM:
            *f_bspSpd_pu32 = GPIO_SPEED_FREQ_MEDIUM;
            break;
        case FMKIO_SPD_MODE_HIGH:
            *f_bspSpd_pu32 = GPIO_SPEED_FREQ_HIGH;
            break;
        case FMKIO_SPD_MODE_NB:
        default:
            Ret_e = RC_ERROR_PARAM_NOT_SUPPORTED;
            break;
        }
    }
    return Ret_e;
}

/*********************************
 * s_FMKIO_Get_BspTriggerMode
 *********************************/
static t_eReturnState s_FMKIO_Get_BspTriggerMode(t_eFMKIO_SigTrigCptr f_trigger_e, t_uint32 *f_bspTrigger_pu32)
{
    t_eReturnState Ret_e = RC_OK;

    if (f_trigger_e > FMKIO_STC_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (f_bspTrigger_pu32 == (t_uint32 *)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if (Ret_e == RC_OK)
    {
        switch (f_trigger_e)
        {
        case FMKIO_STC_RISING_EDGE:
            *f_bspTrigger_pu32 = GPIO_MODE_IT_RISING;
            break;
        case FMKIO_STC_FALLING_EDGE:
            *f_bspTrigger_pu32 = GPIO_MODE_IT_FALLING;
            break;
        case FMKIO_STC_BOTH_EDGE:
            *f_bspTrigger_pu32 = GPIO_MODE_IT_RISING_FALLING;
            break;
        case FMKIO_STC_NB:
        default:
            Ret_e = RC_ERROR_PARAM_NOT_SUPPORTED;
            break;
        }
    }
    return Ret_e;
}

/*********************************
 * s_FMKIO_Get_BspGpioPort
 *********************************/
static t_eReturnState s_FMKIO_Get_BspGpioPort(t_eFMKIO_GpioPort f_GpioPort_e, GPIO_TypeDef **f_BspGpio_ps)
{
    t_eReturnState Ret_e = RC_OK;

    if (f_GpioPort_e > FMKIO_GPIO_PORT_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (f_BspGpio_ps == (GPIO_TypeDef **)NULL)
    {
        Ret_e = RC_ERROR_PTR_NULL;
    }
    if (Ret_e == RC_OK)
    {
        switch (f_GpioPort_e)
        {
            /* CAUTION : Automatic generated code section for GPIO switch case: Start */
            case FMKIO_GPIO_PORT_A:
                *f_BspGpio_ps = GPIOA;
                break;
            case FMKIO_GPIO_PORT_B:
                *f_BspGpio_ps = GPIOB;
                break;
            case FMKIO_GPIO_PORT_C:
                *f_BspGpio_ps = GPIOC;
                break;
            case FMKIO_GPIO_PORT_D:
                *f_BspGpio_ps = GPIOD;
                break;
            case FMKIO_GPIO_PORT_F:
                *f_BspGpio_ps = GPIOF;
                break;
            /* CAUTION : Automatic generated code section for GPIO switch case: End */
            case FMKIO_GPIO_PORT_NB:
            default:
                Ret_e = RC_WARNING_NO_OPERATION;
                break;
            }
    }
    return Ret_e;
}

/*********************************
 * s_FMKIO_Set_BspSigCfg
 *********************************/
static t_eReturnState s_FMKIO_Set_BspSigCfg(t_eFMKIO_GpioPort f_gpioPort_e,
                                            t_eFMKIO_BspGpioPin f_pin_e,
                                            t_uint32 f_mode_u32,
                                            t_eFMKIO_PullMode f_pull_e,
                                            t_eFMKIO_SpdMode f_spd_e,
                                            t_uint8 f_AltFunc_u8)
{
    t_eReturnState Ret_e = RC_OK;
    GPIO_TypeDef *bspGpio_ps = (GPIO_TypeDef *)NULL;
    GPIO_InitTypeDef bspInit_s;
    t_uint32 bspPull_32 = 0;
    t_uint32 bspSpd_u32 = 0;

    if (f_gpioPort_e > FMKIO_GPIO_PORT_NB || f_pin_e > FMKIO_GPIO_PIN_NB || f_pull_e > FMKIO_PULL_MODE_NB || f_spd_e > FMKIO_SPD_MODE_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        Ret_e = s_FMKIO_Get_BspGpioPort(f_gpioPort_e, &bspGpio_ps);
        if (Ret_e == RC_OK)
        {
            Ret_e = s_FMKIO_Get_BspPullMode(f_pull_e, &bspPull_32);
        }
        if (Ret_e == RC_OK)
        {
            Ret_e = s_FMKIO_Get_BspSpdMode(f_spd_e, &bspSpd_u32);
        }
        if (g_IsGpioClockEnable_ae[f_gpioPort_e] == FMKCPU_CLOCKPORT_OPE_DISABLE)
        {
            Ret_e = s_FMKIO_Set_GpioClkState(f_gpioPort_e, FMKCPU_CLOCKPORT_OPE_ENABLE);
        }
        if (Ret_e == RC_OK)
        {
            bspInit_s.Mode = (t_uint32)f_mode_u32;
            bspInit_s.Pin = (t_uint32)c_BspPinMapping_ua32[f_pin_e];
            bspInit_s.Pull = (t_uint32)bspPull_32;
            bspInit_s.Speed = (t_uint32)bspSpd_u32;
            if (f_AltFunc_u8 != (t_uint8)FMKIO_AF_UNUSED)
            {
                bspInit_s.Alternate = (t_uint32)f_AltFunc_u8;
            }
            HAL_GPIO_Init(bspGpio_ps, &bspInit_s);
        }
    }
    return Ret_e;
}

/*********************************
 * s_FMKIO_Set_GpioClkState
 *********************************/
static t_eReturnState s_FMKIO_Set_GpioClkState(t_eFMKIO_GpioPort f_gpioPort_e, t_eFMKCPU_ClockPortOpe f_ope_e)
{
    t_eReturnState Ret_e = RC_OK;
    t_eFMKCPU_ClockPort gpioClkPort_e;

    if (f_gpioPort_e > FMKIO_GPIO_PORT_NB)
    {
        Ret_e = RC_ERROR_PARAM_INVALID;
    }
    if (Ret_e == RC_OK)
    {
        // get the GPIO CLOCK ENUM
        switch (f_gpioPort_e)
        {
        case FMKIO_GPIO_PORT_A:
            gpioClkPort_e = FMKCPU_RCC_CLK_GPIOA;
            break;
        case FMKIO_GPIO_PORT_B:
            gpioClkPort_e = FMKCPU_RCC_CLK_GPIOB;
            break;
        case FMKIO_GPIO_PORT_C:
            gpioClkPort_e = FMKCPU_RCC_CLK_GPIOC;
            break;
        case FMKIO_GPIO_PORT_F:
            gpioClkPort_e = FMKCPU_RCC_CLK_GPIOF;
            break;
        case FMKIO_GPIO_PORT_D:
        case FMKIO_GPIO_PORT_NB:
        default:
            Ret_e = RC_WARNING_NO_OPERATION;
            break;
        }
        if (Ret_e == RC_OK)
        {
            Ret_e = FMKCPU_Set_HwClock(gpioClkPort_e, f_ope_e);
        }
        if (Ret_e == RC_OK)
        {
            g_IsGpioClockEnable_ae[f_gpioPort_e] = f_ope_e;
        }
    }
    return Ret_e;
}
//********************************************************************************
//                      HAL_Callback Implementation
//********************************************************************************
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin)
{
    t_uint8 LLI_u8;
    t_eFMKIO_BspGpioPin bspPinEvnt_e;
    for(LLI_u8 = (t_uint8)0 ; LLI_u8 < FMKIO_INPUT_SIGEVNT_NB ; LLI_u8++)
    {
        bspPinEvnt_e = c_InEvntSigBspMap_as[LLI_u8].BasicCfg.HwPin_e;
        if(c_BspPinMapping_ua32[bspPinEvnt_e] == GPIO_Pin)
        {
            break;
        }
    }
    if(g_InEvntSigInfo_as[LLI_u8].EvntFunc_cb != (t_cbFMKIO_EventFunc *)NULL_FONCTION)
    {
        g_InEvntSigInfo_as[LLI_u8].EvntFunc_cb();
    }
    
    return;
}
//************************************************************************************
// End of File
//************************************************************************************

/**
 *
 *	@brief
 *	@note   
 *
 *
 *	@params[in]
 *	@params[in]
 *
 *
 *
 */
